HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCpu_bf.h
/**
 * \file IfxCpu_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Cpu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Cpu_Registers
 * 
 */
#ifndef IFXCPU_BF_H
#define IFXCPU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Cpu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_CPU_FLASHCON0_Bits.TAG1 */
#define IFX_CPU_FLASHCON0_TAG1_LEN (6u)

/** \brief Mask for Ifx_CPU_FLASHCON0_Bits.TAG1 */
#define IFX_CPU_FLASHCON0_TAG1_MSK (0x3fu)

/** \brief Offset for Ifx_CPU_FLASHCON0_Bits.TAG1 */
#define IFX_CPU_FLASHCON0_TAG1_OFF (0u)

/** \brief Length for Ifx_CPU_FLASHCON0_Bits.TAG2 */
#define IFX_CPU_FLASHCON0_TAG2_LEN (6u)

/** \brief Mask for Ifx_CPU_FLASHCON0_Bits.TAG2 */
#define IFX_CPU_FLASHCON0_TAG2_MSK (0x3fu)

/** \brief Offset for Ifx_CPU_FLASHCON0_Bits.TAG2 */
#define IFX_CPU_FLASHCON0_TAG2_OFF (8u)

/** \brief Length for Ifx_CPU_FLASHCON0_Bits.TAG3 */
#define IFX_CPU_FLASHCON0_TAG3_LEN (6u)

/** \brief Mask for Ifx_CPU_FLASHCON0_Bits.TAG3 */
#define IFX_CPU_FLASHCON0_TAG3_MSK (0x3fu)

/** \brief Offset for Ifx_CPU_FLASHCON0_Bits.TAG3 */
#define IFX_CPU_FLASHCON0_TAG3_OFF (16u)

/** \brief Length for Ifx_CPU_FLASHCON0_Bits.TAG4 */
#define IFX_CPU_FLASHCON0_TAG4_LEN (6u)

/** \brief Mask for Ifx_CPU_FLASHCON0_Bits.TAG4 */
#define IFX_CPU_FLASHCON0_TAG4_MSK (0x3fu)

/** \brief Offset for Ifx_CPU_FLASHCON0_Bits.TAG4 */
#define IFX_CPU_FLASHCON0_TAG4_OFF (24u)

/** \brief Length for Ifx_CPU_FLASHCON1_Bits.STALL */
#define IFX_CPU_FLASHCON1_STALL_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON1_Bits.STALL */
#define IFX_CPU_FLASHCON1_STALL_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON1_Bits.STALL */
#define IFX_CPU_FLASHCON1_STALL_OFF (0u)

/** \brief Length for Ifx_CPU_FLASHCON1_Bits.MASKUECC */
#define IFX_CPU_FLASHCON1_MASKUECC_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON1_Bits.MASKUECC */
#define IFX_CPU_FLASHCON1_MASKUECC_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON1_Bits.MASKUECC */
#define IFX_CPU_FLASHCON1_MASKUECC_OFF (16u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.RECDIS */
#define IFX_CPU_FLASHCON2_RECDIS_OFF (0u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.ECCCORDIS */
#define IFX_CPU_FLASHCON2_ECCCORDIS_OFF (2u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.HMARGIN */
#define IFX_CPU_FLASHCON2_HMARGIN_OFF (8u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.MSEL */
#define IFX_CPU_FLASHCON2_MSEL_OFF (10u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.ECCSCLR */
#define IFX_CPU_FLASHCON2_ECCSCLR_OFF (16u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.SBABCLR */
#define IFX_CPU_FLASHCON2_SBABCLR_OFF (24u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.DBABCLR */
#define IFX_CPU_FLASHCON2_DBABCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.DBABCLR */
#define IFX_CPU_FLASHCON2_DBABCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.DBABCLR */
#define IFX_CPU_FLASHCON2_DBABCLR_OFF (26u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.MBABCLR */
#define IFX_CPU_FLASHCON2_MBABCLR_OFF (28u)

/** \brief Length for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_LEN (2u)

/** \brief Mask for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_MSK (0x3u)

/** \brief Offset for Ifx_CPU_FLASHCON2_Bits.ZBABCLR */
#define IFX_CPU_FLASHCON2_ZBABCLR_OFF (30u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.ECCERRINJ */
#define IFX_CPU_FLASHCON3_ECCERRINJ_OFF (0u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.EDCERRINJ */
#define IFX_CPU_FLASHCON3_EDCERRINJ_OFF (1u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.SBABERRINJ */
#define IFX_CPU_FLASHCON3_SBABERRINJ_OFF (2u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_MSK (0x1u)

